arc/cf/InformationRegisters/ЭтапыПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыПроцесса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийЭтапПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайняяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяДатаОкончанияЭтапов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

arc/cf/InformationRegisters/СостоянияЗадачПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияЗадачПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаксимальныйВозможныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗоныЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначениеУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗадачПредшественников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗначениеУпорядочиванияНаУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадачПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовностиКВыполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

arc/cf/Enums/СтатусыЗадачПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗадачПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаКВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

arc/cf/Catalogs/ЗадачиПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроцесса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцесса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиШаблонаПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролирующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДлительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПорученияПоЗадаче</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтработкиПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоследнегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредшествующиеЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредшествующаяЗадача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПротоколВзаимодействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПоручения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсполнительПоручения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадачПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

arc/cf/InformationRegisters/ЭтапыПроцесса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура РасчитатьЭтапыПроцессаПоПредмету(Предмет) Экспорт
	
	Если Не ЗначениеЗаполнено(Предмет) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиПроцесса.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|ГДЕ
	|	ЗадачиПроцесса.ЗадачаШаблона <> ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)
	|	И ЗадачиПроцесса.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	МассивРассчитываемыхЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Родитель");
	МассивРассчитываемыхЗадач.Добавить(Справочники.ЗадачиПроцесса.ПустаяСсылка());
	РассчитатьЭтапыПроцессаПоМассивуРодителей(МассивРассчитываемыхЗадач, Предмет);
	
КонецПроцедуры

Процедура РассчитатьЭтапыПроцессаПоМассивуРодителей(МассивРассчитываемыхЗадач, Предмет) Экспорт
	
	Если МассивРассчитываемыхЗадач.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонПроцесса = ЗадачиПроцессов.ШаблонПроцессаПоПредмету(Предмет);
	Если ШаблонПроцесса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальнаяДатаОкончанияЭтапов = Неопределено;
	
	Если МассивРассчитываемыхЗадач.Найти(Справочники.ЗадачиПроцесса.ПустаяСсылка()) <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЗадачиПроцесса.КрайняяДатаОкончания) КАК МаксимальнаяДатаОкончанияЭтапов
		|ИЗ
		|	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
		|ГДЕ
		|	ЗадачиПроцесса.Предмет В(&Предмет)
		|	И ЗадачиПроцесса.ЗадачаШаблона <> ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)
		|	И ЗадачиПроцесса.Родитель = ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка)
		|	И ЗадачиПроцесса.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована), ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению))";
		
		Запрос.УстановитьПараметр("Предмет", Предмет);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Выборка.Следующий();
			
			Если Выборка.МаксимальнаяДатаОкончанияЭтапов = Null Тогда
				
				МаксимальнаяДатаОкончанияЭтапов = Дата(1,1,1);
				
			Иначе
				
				МаксимальнаяДатаОкончанияЭтапов = Выборка.МаксимальнаяДатаОкончанияЭтапов;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗадачиПроцесса.Ссылка        КАК Ссылка,
	|	ЗадачиПроцесса.ЗадачаШаблона КАК ЗадачаШаблона
	|ПОМЕСТИТЬ ЗадачиРодители
	|ИЗ
	|	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|ГДЕ
	|	ЗадачиПроцесса.Ссылка В(&МассивРодителей)
	|	И ЗадачиПроцесса.ЗадачаШаблона <> ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)
	|ГДЕ
	|	ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка) В (&МассивРодителей)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадачиПроцессаРодители.Ссылка                                                                   КАК Родитель,
	|	ЗадачиПроцессаРодители.ЗадачаШаблона                                                            КАК ЗадачаШаблона,
	|	ЕСТЬNULL(ЗадачиПроцесса.ПлановаяДлительность, 0)                                                КАК ПлановаяДлительность,
	|	ЕСТЬNULL(СостоянияЗадачПроцессов.ЗначениеУпорядочивания, 0)                                     КАК ЗначениеУпорядочивания,
	|	ЕСТЬNULL(ЗадачиПроцесса.КрайняяДатаОкончания, ДАТАВРЕМЯ(1, 1, 1, 1, 1, 1))                      КАК КрайняяДатаОкончания,
	|	ЕСТЬNULL(ЗадачиПроцесса.ЗадачаШаблона, ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)) КАК ЭтапПроцесса,
	|ВЫБОР
	|	КОГДА ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)
	|		ТОГДА 0
	|	КОГДА ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована)
	|		ТОГДА 1
	|	ИНАЧЕ 2
	|КОНЕЦ КАК ПорядокПоСтатусу
	|ИЗ
	|	ЗадачиРодители КАК ЗадачиПроцессаРодители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗадачПроцессов КАК СостоянияЗадачПроцессов
	|			ПО ЗадачиПроцесса.Ссылка = СостоянияЗадачПроцессов.ЗадачаПроцесса
	|		ПО (ЗадачиПроцесса.Родитель = ЗадачиПроцессаРодители.Ссылка)
	|			И (НЕ ЗадачиПроцесса.ПометкаУдаления)
	|			И (ЗадачиПроцесса.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована), ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению)))
	|			И (ЗадачиПроцесса.ЗадачаШаблона <> ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка))
	|			И (ЗадачиПроцесса.Предмет = &Предмет)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначениеУпорядочивания,
	|	ПорядокПоСтатусу,
	|	ПлановаяДлительность
	|ИТОГИ ПО
	|	Родитель";
	
	Запрос.УстановитьПараметр("МассивРодителей", МассивРассчитываемыхЗадач);
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	ВыборкаРодители = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРодители.Следующий() Цикл
	
		ТекущийЭтапПроцесса  = Справочники.ЗадачиШаблонаПроцесса.ПустаяСсылка();
		КрайняяДатаОкончания = Дата(1, 1, 1);
		
		ВыборкаДетали = ВыборкаРодители.Выбрать();
		Если ВыборкаДетали.Следующий() Тогда
			
			ЗадачаПроцесса       = ВыборкаДетали.ЗадачаШаблона;
			ТекущийЭтапПроцесса  = ВыборкаДетали.ЭтапПроцесса;
			КрайняяДатаОкончания = ВыборкаДетали.КрайняяДатаОкончания;
			
		КонецЕсли;
		
		ДанныеЗаписи = СтруктураЗаписи();
		ДанныеЗаписи.Предмет              = Предмет;
		ДанныеЗаписи.ШаблонПроцесса       = ШаблонПроцесса;
		ДанныеЗаписи.ЗадачаПроцесса       = ЗадачаПроцесса;
		ДанныеЗаписи.ТекущийЭтапПроцесса  = ТекущийЭтапПроцесса;
		ДанныеЗаписи.КрайняяДатаОкончания = КрайняяДатаОкончания;

		Если ЗадачаПроцесса = Справочники.ЗадачиШаблонаПроцесса.ПустаяСсылка()
			И МаксимальнаяДатаОкончанияЭтапов <> Неопределено Тогда
				
			ДанныеЗаписи.МаксимальнаяДатаОкончанияЭтапов = МаксимальнаяДатаОкончанияЭтапов;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущийЭтапПроцесса)
			И ЗначениеЗаполнено(ЗадачаПроцесса) Тогда
			
			УдалитьЗапись(ДанныеЗаписи);
			
		Иначе
			
			ВыполнитьЗаписьВРегистр(ДанныеЗаписи);
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаписьВРегистр(Данные) Экспорт

	НаборЗаписей = СоздатьНаборЗаписей();
	УстановитьОтборНаборЗаписей(НаборЗаписей, Данные);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, Данные);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьЗапись(Данные) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	УстановитьОтборНаборЗаписей(НаборЗаписей, Данные);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписиПоПредмету(Предмет, УдалятьСвязьСШаблоном = Ложь) Экспорт
	
	Если УдалятьСвязьСШаблоном Тогда
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Предмет.Установить(Предмет);
		НаборЗаписей.Записать();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ 
		|	ЭтапыПроцесса.Предмет        КАК Предмет,
		|	ЭтапыПроцесса.ШаблонПроцесса КАК ШаблонПроцесса,
		|	ЭтапыПроцесса.ЗадачаПроцесса КАК ЗадачаПроцесса
		|ИЗ
		|	РегистрСведений.ЭтапыПроцесса КАК ЭтапыПроцесса
		|ГДЕ
		|	ЭтапыПроцесса.Предмет = &Предмет
		|	И ЭтапыПроцесса.ЗадачаПроцесса <> ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Предмет", Предмет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			ДанныеЗаписи = СтруктураЗаписи();
			ЗаполнитьЗначенияСвойств(ДанныеЗаписи, Выборка);
			УдалитьЗапись(ДанныеЗаписи);
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураЗаписи() Экспорт
	
	ДанныеЗаписи = Новый Структура;
	
	ДанныеЗаписи.Вставить("Предмет",                         Неопределено);
	ДанныеЗаписи.Вставить("ШаблонПроцесса",                  Справочники.ШаблоныПроцесса.ПустаяСсылка());
	ДанныеЗаписи.Вставить("ЗадачаПроцесса",                  Справочники.ЗадачиШаблонаПроцесса.ПустаяСсылка());
	ДанныеЗаписи.Вставить("ТекущийЭтапПроцесса",             Справочники.ЗадачиШаблонаПроцесса.ПустаяСсылка());
	ДанныеЗаписи.Вставить("КрайняяДатаОкончания",            Дата(1,1,1));
	ДанныеЗаписи.Вставить("МаксимальнаяДатаОкончанияЭтапов", Дата(1,1,1));
	
	Возврат ДанныеЗаписи;
	
КонецФункции

Процедура СвязатьПроцессИШаблон(Предмет, Шаблон) Экспорт
	
	Данные = СтруктураЗаписи();
	Данные.Предмет        = Предмет;
	Данные.ШаблонПроцесса = Шаблон;
	Данные.ЗадачаПроцесса = Справочники.ЗадачиПроцесса.ПустаяСсылка();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	УстановитьОтборНаборЗаписей(НаборЗаписей, Данные);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(ЗаписьНабора, Данные);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Предмет.Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтборНаборЗаписей(НаборЗаписей, Данные)
	
	НаборЗаписей.Отбор.Предмет.Установить(Данные.Предмет);
	НаборЗаписей.Отбор.ШаблонПроцесса.Установить(Данные.ШаблонПроцесса);
	НаборЗаписей.Отбор.ЗадачаПроцесса.Установить(Данные.ЗадачаПроцесса);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
